{
    "pageTitle": "Experiences",
    "experiences": [
        {   
            "title": [
                "WSO2",
                "Software Engineer",
                "May 2022 - Present"
            ],
            "content": [
                {
                    "title": "Organization’s Activities",
                    "body": "WSO2 is one of the biggest open-source technology providers in the world today. Their main products are Identity Server, Choreo and Ballerina."
                },
                {
                    "title": "My Responsibilities",
                    "body": "My primary tasks are to work on the managment and development of the Identity Server and Asgardeo's front-end features. For development, I mainly use React JS and Java"
                },
                {
                    "title": "My Accomplishments",
                    "body": "In just two weeks, I developed a complete website to demonstrate a newly developed feature, using a technology I had never used before. This is the applicaiton that is currently used by the company to demonstrate that new feature."
                },
                {
                    "title": "Challenges Faced",
                    "body": "Being new to the field of Identity and Access Management, it was challenging to learn a lot of new concepts quickly."
                }
            ]
        },
        {   
            "title": [
                "Department of Computer Science & Engineering, University of Moratuwa",
                "Visting Instructor",
                "Feb 2022 - Apr 2022"
            ],
            "place": "Department of Computer Science & Engineering, University of Moratuwa",
            "position": "Visting Instructor",
            "duration": "Feb 2022 - Apr 2022",
            "content": [
                {
                    "title": "Organization’s Activities",
                    "body": "I had the privilege of serving as a Teaching Assistant for the CS 3042 Database Systems module at the Department of Computer Science & Engineering, University of Moratuwa. This module focused on the fundamentals of database design."
                },
                {
                    "title": "My Responsibilities",
                    "body": "As a teaching assistant, my primary responsibilities involved guiding and supporting students during practical sessions and grading their assignments."
                },
                {
                    "title": "My Accomplishments",
                    "body": "One of the most gratifying moments during my brief tenure was when I successfully assisted a struggling student in comprehending a challenging topic within the module. Witnessing the student's progress was truly enlightening and rewarding."
                },
                {
                    "title": "Challenges Faced",
                    "body": "Throughout my time as a teaching assistant, I encountered the main challenge of determining the most effective ways to support and assist students. Initially, it was a daunting task, but as time passed, I developed a natural and enjoyable approach that encouraged students' growth and understanding. This experience as a teaching assistant improved my skills in communication, mentorship, and problem-solving, and I am grateful for the opportunity to contribute to the learning journey of aspiring computer science students."
                }
            ]
        },
        {   
            "title": [
                "Fcode Labs",
                "Software Engineer - Intern",
                "Oct 2020 - Apr 2021"
            ],
            "content": [
                {
                    "title": "Organization’s Activities",
                    "body": "During my time at Fcode Labs, an emerging software engineering organization based in Sri Lanka and Singapore, I held the role of a Mobile Developer and UI/UX Designer. My core responsibilities revolved around designing and developing mobile applications for the company."
                },
                {
                    "title": "My Responsibilities",
                    "body": "One of the highlights of my experience was leading the development of the company's product, 'Workmate' during my relatively brief tenure with the organization. Despite the challenges posed by the COVID-19 epidemic, which required a shift to a work-from-home setup, I successfully adapted with the support and collaboration of the team."
                },
                {
                    "title": "My Accomplishments",
                    "body": "As a Software Engineer - Intern, I was able to contribute my skills and knowledge to drive innovation and create user-centric solutions."
                },
                {
                    "title": "Challenges Faced",
                    "body": "My time at Fcode Labs was not only a valuable learning experience but also a rewarding journey, and I am grateful for the opportunities it provided."
                }
            ]
        },
        {   
            "title": [
                "Sieve - Privacy Wherever You Go",
                "User Interface and User Experience Designer",
                "Jul 2020 - Oct 2020"
            ],
            "content": [
                {
                    "title": "Organization’s Activities",
                    "body": "Sieve is a Singapore-based company with a primary mission of empowering consumers to make informed decisions concerning their digital privacy. As a User Interface and User Experience Designer, I played a pivotal role in the design of a data privacy chatbot application and the revamp of the company website."
                },
                {
                    "title": "My Responsibilities",
                    "body": "Throughout my time at Sieve, I encountered a significant challenge that involved adapting to collaborate with individuals from diverse ethnic and cultural backgrounds."
                },
                {
                    "title": "My Accomplishments",
                    "body": "Despite it being a challenging experience, the team provided valuable support, helping me to swiftly acclimate to this new work environment."
                },
                {
                    "title": "Challenges Faced",
                    "body": "Working at Sieve was an enriching part-time opportunity that allowed me to contribute to an important cause while honing my design skills. I took great pride in being part of a team that advocates for digital privacy and empowers users to safeguard their information."
                }
            ]
        }
    ]
}