{
    "pageTitle": "Research and Industrial Experiences",
    "experiences": [
        {
            "title": "Research Experience",
            "content" : [
                {   
                    "title": [
                        "KTH Royal Institute of Technology",
                        "Research Engineer",
                        "May 2023"
                    ],
                    "content": [
                        {
                            "body": "At KTH Royal Institute of Technology, I worked on enhancing software supply chain security as part of the CHAINS project. Additionally, I contributed to research projects in the areas of generative AI and software testing."
                        }
                    ]
                }
            ]
        },
        {
            "title": "Teaching Experience",
            "content" : [
                {   
                    "title": [
                        "Département d'informatique et de recherche opérationnelle, Université de Montréal",
                        "Graduate research assistant - Qualité du logiciel",
                        "Aug 2024 - Dec 2024"
                    ],
                    "place": "Département d'informatique et de recherche opérationnelle, Université de Montréal",
                    "position": "Graduate research assistant",
                    "duration": "Aug 2024 - Dec 2024",
                    "content": [
                        {
                            "body": "As a graduate research assistant for the module 'Qualité du logiciel', I assisted students with lab sessions, selected projects for student assignments and graded them."
                        }
                    ]
                },
                {   
                    "title": [
                        "Department of Computer Science & Engineering, University of Moratuwa",
                        "Visting Instructor - Database Systems",
                        "Feb 2022 - Apr 2022"
                    ],
                    "place": "Department of Computer Science & Engineering, University of Moratuwa",
                    "position": "Visting Instructor",
                    "duration": "Feb 2022 - Apr 2022",
                    "content": [
                        {
                            "body": "As a visiting instructor for the module 'CS3042: Database Systems', my main responsibilities were to assist students with lab sessions and grade student assignments."
                        }
                    ]
                },
                {   
                    "title": [
                        "Department of Computer Science & Engineering, University of Moratuwa",
                        "Visting Instructor - Software Engineering Project",
                        "Jul 2023 - Nov 2023"
                    ],
                    "place": "Department of Computer Science & Engineering, University of Moratuwa",
                    "position": "Visting Instructor",
                    "duration": "Jul 2023 - Nov 2023",
                    "content": [
                        {
                            "body": "For the module 'CS3202: Software Engineering Project' for bachelor's students in semester 5, I presented online sessions on web development, security best practices, and version control systems.",
                            "presentations": [
                                {
                                    "link": "https://www.youtube.com/embed/XjesOQhtW8w?si=_UyAQXv7D-WaJroF"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "title": "Industrial Experience",
            "content" : [
                {   
                    "title": [
                        "WSO2 LLC",
                        "Software Engineer (Research and Development)",
                        "May 2022 - May 2023"
                    ],
                    "content": [
                        {
                            "title": "Organization’s Activities",
                            "body": "WSO2 is the world's #1 open-source integration vendor, helping digitally driven organizations become integration agile. The company’s hybrid platform for developing, reusing, running, and managing integrations prevents lock-in through open-source software that runs on-premises or in the cloud."
                        },
                        {
                            "title": "My Tasks",
                            "body": "At WSO2, I was part of the research and development team for the WSO2 Identity Server 6.0 release. Initially, I worked on testing the WSO2 Identity Server and updating the WSO2 Identity and Access Management repositories to support compilation in JDK 11 and JDK 17. Then, I worked on the IAM cloud management team, focusing on maintaining the Asgardeo product. My tasks included designing and implementing email-sending features for Asgardeo tenants and fixing issues. I also revamped the Asgardeo resource monitor architecture to improve performance and scalability limitations. My revamping efforts included removing the schedulers from the resource monitor and invoking them as Kubernetes cron jobs and providing resource throttling support for the EU region by adding a data layer."
                        }
                    ]
                },
                {   
                    "title": [
                        "IronOne Technologies LLC",
                        "Software Engineer - Intern",
                        "Oct 2020 - Apr 2021"
                    ],
                    "content": [
                        {
                            "title": "Organization’s Activities",
                            "body": "IronOne Technologies is an innovative technology company with global presence across many key regions operating on cutting edge technological solutions. Ironone Operates three key business units; ATrad a comprehensive capital markets & trading platform, IroOne AI Labs which is a provider of highly skilled AI talent to solve complex business problems and the bespoke module solutions and services unit."
                        },
                        {
                            "title": "My Tasks",
                            "body": "I worked in the frontend of the admin site of the theXchange ticketing platform. I developed various features such as dashboard, closed sales details, promo codes, events, seller payouts, charities, and admin users. The technologies and platforms used were Angular, TypeScript, HTML, SCSS, Invision, BitBucket, Azure DevOps, AWS Auth."
                        },
                        {
                            "body": "I was also involved in updating the User Interfaces of the Victoria's Secret Pink campus rep application process (Login and Upload a Moodboard, Schedule an Interview, Add Skype Information, Interview Review and Confirmation and Answer Questions Pages). The technologies and platforms used were Angular, Icons8 Lunacy and Sifterapp."
                        }
                    ]
                }
            ]
        }

    ]
}