{
    "pageTitle": "Research and Industrial Experiences",
    "experiences": [
        {   
            "title": [
                "WSO2",
                "Software Engineer (Research and Development)",
                "May 2022 - May 2023"
            ],
            "content": [
                {
                    "title": "Organization’s Activities",
                    "body": "WSO2 is an open-source technology provider founded in 2005. It delivers software and cloud solutions that provide foundational technologies for application development and identity and access management. Their main products are Identity Server, Choreo and Ballerina."
                },
                {
                    "title": "My Responsibilities",
                    "body": "At WSO2, I am working with the identity access management team. My primary responsibilities include front-end development and UI/UX design for the company's products, namely Identity Server and Asgardeo. Additionally, I provide assistance to the team on Flutter-related matters and actively engage in discussions. For development and design tasks, I primarily utilize React JS, Figma, Next JS and Flutter."
                }
            ]
        },
        {   
            "title": [
                "Fcode Labs",
                "Software Engineer - Intern (UI/UX, Front-end)",
                "Oct 2020 - Apr 2021"
            ],
            "content": [
                {
                    "title": "Organization’s Activities",
                    "body": "During my time at Fcode Labs, an emerging software engineering organization based in Sri Lanka and Singapore, I had the privilege of immersing myself in a dynamic work environment."
                },
                {
                    "title": "My Responsibilities",
                    "body": "In my role as a Mobile Developer and UI/UX Designer, my main responsibilities revolved around the creative and technical aspects of mobile application development for the company. A significant highlight of my tenure was taking the leadership in the development of Fcode Labs' flagship product, 'Workmate.'For development and design tasks, I primarily utilized Flutter, and Figma. "
                },
                {
                    "title": "My Accomplishments",
                    "body": "Amidst the challenging COVID-19 pandemic, which forced the team a shift to remote work, I successfully completed the development of 'Workmate.' Additionally, my contributions as a Software Engineer - Intern fostered innovation and resulted in user-centric solutions. My time at Fcode Labs was a valuable learning experience for me."
                },
                {
                    "title": "Challenges Faced",
                    "body": "The sudden transition to a work-from-home setup due to the pandemic presented a formidable challenge. However, with the help of the team, we were able to adapt quickly and effectively to continue our work."
                }
            ]
        },
        {   
            "title": [
                "Department of Computer Science & Engineering, University of Moratuwa",
                "Visting Instructor",
                "Jul 2023 - Nov 2023 & Feb 2022 - Apr 2022"
            ],
            "place": "Department of Computer Science & Engineering, University of Moratuwa",
            "position": "Visting Instructor",
            "duration": "Jul 2023 - Nov 2023 & Feb 2022 - Apr 2022",
            "content": [
                {
                    "title": "My Responsibilities",
                    "body": "During the first tenure for the Database module, my primary responsibilities involved guiding and supporting students during practical sessions, grading their assignments, and later creating instructional videos to help students get started with web development, technologies, trends, and security concerns."
                }
            ]
        },
        {   
            "title": [
                "Department of Computer Science & Engineering, University of Moratuwa",
                "Visting Instructor",
                "Jul 2023 - Nov 2023 & Feb 2022 - Apr 2022"
            ],
            "place": "Department of Computer Science & Engineering, University of Moratuwa",
            "position": "Visting Instructor",
            "duration": "Jul 2023 - Nov 2023 & Feb 2022 - Apr 2022",
            "content": [
                {
                    "title": "My Responsibilities",
                    "body": "During the first tenure for the Database module, my primary responsibilities involved guiding and supporting students during practical sessions, grading their assignments, and later creating instructional videos to help students get started with web development, technologies, trends, and security concerns.",
                    "presentations": [
                        {
                            "link": "https://www.youtube.com/embed/videoseries?si=zj_nuEvPPHxcnmVt&amp;list=PLrkEOVQA1S7JQbxOxq7yf3IjH9C5U5dSv"
                        },
                        {
                            "link": "https://www.youtube.com/embed/videoseries?si=zj_nuEvPPHxcnmVt&amp;list=PLrkEOVQA1S7JQbxOxq7yf3IjH9C5U5dSv"
                        }
                    ]
                }
            ]
        }
    ]
}