{
    "pageTitle": "About Me",
    "content": {
        "firstPara": [
            {
                "key": "me-1",
                "body": "Hi there! I’m a PhD student at the Université de Montréal, where I’m working on enhancing software supply chain security under the supervision of Prof. Benoit Baudry. More broadly, my research interests lie in software security, software testing, and software reliability."
            }
        ],
        "contentDetails": [
            {
                "title": "Education",
                "content": [
                    {
                        "title": [
                            "Département d'informatique et de recherche opérationnelle, Université de Montréal, Canada",
                            "PhD in Computer Science",
                            "Sep 2024 - Present"
                        ],
                        "content": [
                            {
                                "body": []
                            }
                        ]
                    },
                    {
                        "title": [
                            "Department of Computer Science and Engineering, Faculty of Engineering, University of Moratuwa, Sri Lanka",
                            "Bachelor of the Science of Engineering, Specialisation: Computer Science & Engineering",
                            "Aug 2017 - July 2022"
                        ],
                        "content": [
                            {
                                "body": []
                            }
                        ]
                    },
                    {
                        "title": [
                            "Primary and Secondary Education",
                            "Southlands College, Galle, Sri Lanka",
                            "2003-2016"
                        ],
                        "content": [
                            {
                                "body": []
                            }
                        ]
                    }
                ]
            },
            {
                "title": "Misc",
                "content": [
                    {
                        "title": [
                            "Algorithmic Art"
                        ],
                        "content": [
                            {
                                "body": [
                                    {
                                        "body": [
                                            "Inspired by my PhD supervisor, Benoit Baudry, I have recently started experimenting with algorithmic art. I'm not an artist, but I find it fascinating how slight variations in a few lines of code (or even just reloading the piece) can produce drastically different artworks. Here are two of my randomly selected pieces."
                                        ]
                                    }
                                ]
                            },
                            {
                                "title": "Random Artworks",
                                "body": [
                                  {
                                    "file": "/artworks/gibberish/index.html",
                                    "width": 500,
                                    "height": 400
                                  },
                                  {
                                    "file": "/artworks/glass/index.html",
                                    "width": 500,
                                    "height": 500
                                  },
                                  {
                                    "file": "/artworks/glassbw/index.html",
                                    "width": 500,
                                    "height": 500
                                  },
                                  {
                                    "file": "/artworks/theo/index.html",
                                    "width": 500,
                                    "height": 400
                                  }
                                ]
                              }
                        ]
                    },
                    {
                        "title": [
                            "Table Tennis"
                        ],
                        "content": [
                            {
                                "body": [
                                    {
                                        "body": [
                                            "I love sports in general. Through the years, from time to time, I have been following Cricket, Tennis, and Football games. However, the only sport I actually played was Table Tennis. I started playing Table Tennis when I was 6 years old. There were many times that I fell out of love for the game, but my parents' enthusiasm to see me play kept me going. In case you are interested, here is a boring list of my Table Tennis achievements."
                                        ]
                                    }
                                ]
                            },
                            {
                                "title": "Representing the Table Tennis team of WSO2 LLC",
                                "body": [
                                    {
                                        "body": [
                                            "2023 - Inter IT Club Knockout Tournament Women's Doubles - Champion"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2023 - Inter IT Club Knockout Tournament Mixed Doubles - Champion"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2022 - 63rd Mercantile Inter Club League Championship Women's C Division - Runner-up"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2022 - MTTA Individual Open Championship Novices Women's - Champion"
                                        ]
                                    }
                                ]
                            },
                            {
                                "title": "Representing the Table Tennis team of the University of Moratuwa",
                                "body": [
                                    {
                                        "body": [
                                            "2019 - Sri Lanka University Games - Champion"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2019 - University of Moratuwa Colors Award"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2019 - Wayo Spins Inter University tournament - Champion"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2019 - SIEG Inter University tournament - Champion"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2018 - Inter University Games - Champion"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2018 - University of Moratuwa Colors Award"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2018 - Mora Smashes Inter University tournament - Champion"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2018 - Wayo Spins Inter University tournament - Champion"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2018 - KDU Leaders' Trophy Inter University tournament - Champion"
                                        ]
                                    }
                                ]
                            },
                            {
                                "title": "Representing the Table Tennis team of Southland College",
                                "body": [
                                    {
                                        "body": [
                                            "2013 - All Island School Games - Silver Medal"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2013 - Southern Province Sports Colors"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2012 - All Island School Games - Silver Medal"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2012 - All Island Inter-School Under 19 Girls C-Division - Champion"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2012 - All Island Inter-School Under 18 Girls B-Division - Runner-Up"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2011-  All Island School Games - Bronze Medal"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2011 - All Island Inter-School Under 16 Girls B-Division - Runner-Up"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2010 - All Island Inter-School Under 14 Girls B-Division - Champion"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2010 - All Island Inter-School Under 18 Girls C-Division - Runner-Up"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2009 - All Island Inter-School Under 12 Girls A-Division - Runner-Up"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2009 - All Island Inter-School Under 16 Girls C-Division - Champion"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2008 - All Island Inter-School Under 12 Girls C-Division - Champion"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2007 - Sri Lanka Table Tennis Colors - Merit Award"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2007 - All Island Inter-School Under 10 Girls A-Division - Champion"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2005 - All Island Inter-School Under 10 Girls A-Division - Runner-Up"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2004 - All Island Inter-School Under 10 Girls B-Division - Runner-Up"
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    }
}
