{
    "pageTitle": "Who am I ?",
    "content": {
        "firstPara": "A highly motivated and hardworking individual with a keen interest in learning more about Computer Science especially in the area of Front End Development and UI/UX designing. Also has a passion for learning psychology as well. My life goal is to do something that my dad one day would be proud of.",
        "fistImages": [
            {
                "image": "/images/me/me-1.jpg",
                "alt": "achintha isuru - 1"
            },
            {
                "image": "/images/me/me-2.jpg",
                "alt": "achintha isuru - 1"
            },
            {
                "image": "/images/me/me-3.jpg",
                "alt": "achintha isuru - 1"
            }
        ],
        "contentDetails": [
            {
                "title": "Education",
                "content": [
                    {
                        "title": [
                            "Google (through Coursera)",
                            "Google UX Design Professional Certificate",
                            "May 2022 - Present"
                        ],
                        "content": [
                            {
                                "body": "I started following the Google UX Design Professional Certificate to get the first hand experience and knowledge about UX designing. Through Google UX Design Professional Certificate I was able to dive deep to learn what UX Design is. From this course I learn about the basics about the design process, empathise with users, define pain points, ideate solutions, create wireframes and prototypes, and also test and iterate on the design. I am currently following this course."
                            }
                        ]
                    },
                    {
                        "title": [
                            "Department of Computer Science and Engineering, Faculty of Engineering, University of Moratuwa",
                            "Bachelor of the Science of Engineering, Specialisation: Computer Science & Engineering",
                            "Aug 2017 - Dec 2022"
                        ],
                        "content": [
                            {
                                "body": "My bachelor's degree was earned at the University of Moratuwa's Department of Computer Science and Engineering in Sri Lanka. During my university years, I was not just concerned with my schoolwork, but I also participated in extracurricular activities such as soccer and Rotaract. I played goalkeeper for my university's soccer team. I was also a member of the Rotaract Club of the University of Moratuwa's public relations team.",
                                "images": [
                                    {
                                        "image": "/images/me/uni-1.jpg",
                                        "alt": "achintha isuru - 1"
                                    },
                                    {
                                        "image": "/images/me/uni-2.jpg",
                                        "alt": "achintha isuru - 1"
                                    },
                                    {
                                        "image": "/images/me/uni-3.jpg",
                                        "alt": "achintha isuru - 1"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "title": [
                            "California Institute of the Art (through Coursera)",
                            "UI/UX Specialization",
                            "2020-2021"
                        ],
                        "content": [
                            {
                                "body": "The California Institute of Arts' UI/UX specialism presented me with the opportunity to learn the fundamentals of UI/UX design. This course was quite beneficial because the material of my bachelor's degree did not touch this topic. I was able to secure some UI/UX freelancing work after finishing this course, which truly helped me to improve my skills."
                            }
                        ]
                    }
                ]
            },
            {
                "title": "My Hobbies",
                "content": [
                    {
                        "title": [
                            "Playing Football"
                        ],
                        "content": [
                            {
                                "body": "I've always been a big fan of soccer. However, for a variety of reasons, I was unable to play soccer at my school. So I was determined to play it in college and gain firsthand experience on the field. Simply put, it was about playing the game I love and enjoy. We were able to win the joint championship at Sri Lanka University Games 2019. Also, during my time with the team, I was able to improve my soft skills as well, like teamwork, commitment and dedication. These skills still help me in my professional work.",
                                "images": [
                                    {
                                        "image": "/images/me/soccer-1.jpg",
                                        "alt": "achintha isuru - 1"
                                    },
                                    {
                                        "image": "/images/me/soccer-2.jpg",
                                        "alt": "achintha isuru - 1"
                                    },
                                    {
                                        "image": "/images/me/soccer-3.jpg",
                                        "alt": "achintha isuru - 1"
                                    },
                                    {
                                        "image": "/images/me/soccer-4.jpg",
                                        "alt": "achintha isuru - 1"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "title": [
                            "Social Service"
                        ],
                        "content": [
                            {
                                "body": "I've always enjoyed assisting those in need. A pure joyous laugh from a child will instantly brighten my day. That is why I joined the University Rotaract Club. From there, I was able to participate in various projects and give back at least a little to the society that had given me so much. The main thing I accomplished was that I was able to give back to the society in which I grew up. Furthermore, by working on projects, I was able to improve my soft skills such as communication, leadership, and teamwork.",
                                "images": [
                                    {
                                        "image": "/images/me/rot-1.jpg",
                                        "alt": "achintha isuru - 1"
                                    },
                                    {
                                        "image": "/images/me/rot-2.jpg",
                                        "alt": "achintha isuru - 1"
                                    },
                                    {
                                        "image": "/images/me/rot-3.jpg",
                                        "alt": "achintha isuru - 1"
                                    }
                                ]
                                
                            }
                        ]
                    },
                    {
                        "title": [
                            "Cooking"
                        ],
                        "content": [
                            {
                                "body": "I really enjoy cooking. In my free time I will follow online recieps. My favourite dishes are my parata and dhosi."
                            }
                        ]
                    }
                ]
            }
        ]
    }
}