{
    "pageTitle": "About Me",
    "content": {
        "firstPara": [
            {
                "key": "me-1",
                "body": "Hello everyone! I am a research engineer at KTH Royal Institute of Technology working on enhancing software supply chain security as part of the CHAINS project. I am interested in research in the broad areas of software engineering, software security, and machine learning for software engineering."
            }
        ],
        "contentDetails": [
            {
                "title": "Education",
                "content": [
                    {
                        "title": [
                            "Department of Computer Science and Engineering, Faculty of Engineering, University of Moratuwa",
                            "Bachelor of the Science of Engineering, Specialisation: Computer Science & Engineering",
                            "Aug 2017 - July 2022"
                        ],
                        "content": [
                            {
                                "body": [
                                    {
                                        "body": "I maintained a CGPA of 3.87 out of 4.2 during my Bachelor's degree, and in the final 2 years, I achieved a GPA of 4.04 out of 4.2. I was also selected for the Dean’s list in semesters 1, 4, 5, 6, 7, and 8 for achieving an SGPA of 3.8 or higher in each semester."
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "title": [
                            "Primary and Secondary Education",
                            "Southlands College, Galle, Sri Lanka",
                            "2003-2016"
                        ],
                        "content": [
                            {
                                "body": [
                                    {
                                        "body": "I received my primary and secondary education from Southlands college, Galle. In the GCE Advanced Level Examination (2016) I achieved 4A passes (For Combined Mathematics, Physics, Chemistry, and General English) with an Z-score of 2.416 in the Physical science stream while being ranked among the first 1% of the country."
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "title": "Hobbies",
                "content": [
                    {
                        "title": [
                            "A non-exhaustive list of my Table Tennis achievements"
                        ],
                        "body": [
                            "I started playing Table Tennis when I was 6 years old. There were many times that I fell out of love for the sport, but my parents' enthusiasm to see me play kept me going. I learned a lot from all these years of playing, but the best part was making awesome friends with my incredible teammates. As Mary Lou Retton said, 'A trophy carries dust. Memories last forever.'"
                        ],
                        "content": [
                            {
                                "title": "Representing the Table Tennis team of WSO2 LLC",
                                "body": [
                                    {
                                        "body": [
                                            "2023 - Inter IT Club Knockout Tournament Women's Doubles - Champion"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2023 - Inter IT Club Knockout Tournament Women's Doubles - Champion"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2022 - 63rd Mercantile Inter Club League Championship Women's C Division - Runner-up"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2022 - MTTA Individual Open Championship Novices Women's - Champion"
                                        ]
                                    }
                                ],
                                "images": [
                                    {
                                        "image": "/static/images/me/tt_wso2_1.jpeg",
                                        "alt": "yogya gamage - 1"
                                    },
                                    {
                                        "image": "/static/images/me/tt_wso2_2.jpg",
                                        "alt": "yogya gamage - 1"
                                    },
                                    {
                                        "image": "/static/images/me/tt_wso2_3.jpg",
                                        "alt": "yogya gamage - 1"
                                    }
                                ]
                            },
                            {
                                "title": "Representing the Table Tennis team of the University of Moratuwa",
                                "body": [
                                    {
                                        "body": [
                                            "2019 - Sri Lanka University Games - Champion"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2019 - University of Moratuwa Colors Award"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2019 - Wayo Spins Inter University tournament - Champion"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2019 - SIEG Inter University tournament - Champion"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2018 - Inter University Games - Champion"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2018 - University of Moratuwa Colors Award"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2018 - Mora Smashes Inter University tournament - Champion"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2018 - Wayo Spins Inter University tournament - Champion"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2018 - KDU Leaders' Trophy Inter University tournament - Champion"
                                        ]
                                    }
                                ],
                                "images": [
                                    {
                                        "image": "/static/images/me/tt_mora_1.jpg",
                                        "alt": "yogya gamage - 1"
                                    },
                                    {
                                        "image": "/static/images/me/tt_mora_2.jpg",
                                        "alt": "yogya gamage - 1"
                                    },
                                    {
                                        "image": "/static/images/me/tt_mora_3.jpg",
                                        "alt": "yogya gamage - 1"
                                    }
                                ]
                            },
                            {
                                "title": "Representing the Table Tennis team of Southland College",
                                "body": [
                                    {
                                        "title": "2013",
                                        "body": [
                                            "All Island School Games - Silver Medal",
                                            "Southern Province Sports Colors"
                                        ]
                                    },
                                    {
                                        "title": "2012",
                                        "body": [
                                            "All Island School Games - Silver Medal",
                                            "All Island Inter-School Under 19 Girls C-Division - Champion",
                                            "All Island Inter-School Under 18 Girls B-Division - Runner-Up"
                                        ]
                                    },
                                    {
                                        "title": "2011",
                                        "body": [
                                            "All Island School Games - Bronze Medal",
                                            "All Island Inter-School Under 16 Girls B-Division - Runner-Up"
                                        ]
                                    },
                                    {
                                        "title": "2010",
                                        "body": [
                                            "All Island Inter-School Under 14 Girls B-Division - Champion",
                                            "All Island Inter-School Under 18 Girls C-Division - Runner-Up"
                                        ]
                                    },
                                    {
                                        "title": "2009",
                                        "body": [
                                            "All Island Inter-School Under 12 Girls A-Division - Runner-Up",
                                            "All Island Inter-School Under 16 Girls C-Division - Champion"
                                        ]
                                    },
                                    {
                                        "title": "2008",
                                        "body": [
                                            "All Island Inter-School Under 12 Girls C-Division - Champion"
                                        ]
                                    },
                                    {
                                        "title": "2007",
                                        "body": [
                                            "Sri Lanka Table Tennis Colors - Merit Award",
                                            "All Island Inter-School Under 10 Girls A-Division - Champion"
                                        ]
                                    },
                                    {
                                        "title": "2005",
                                        "body": [
                                            "All Island Inter-School Under 10 Girls A-Division - Runner-Up"
                                        ]
                                    },
                                    {
                                        "title": "2004",
                                        "body": [
                                            "All Island Inter-School Under 10 Girls B-Division - Runner-Up"
                                        ]
                                    }
                                ],
                                "images": [
                                    {
                                        "image": "/static/images/me/tt_scg_1.jpg",
                                        "alt": "yogya gamage - 1"
                                    },
                                    {
                                        "image": "/static/images/me/tt_scg_2.jpg",
                                        "alt": "yogya gamage - 1"
                                    },
                                    {
                                        "image": "/static/images/me/tt_scg_3.jpg",
                                        "alt": "yogya gamage - 1"
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "title": "Random",
                "body": "I love to read books—e-books, paperbacks, and audiobooks alike. Specifically, I like to read fantasy, historical romance, and philosophy.",
                "content": [
                    {
                        "title": [ "10 favorite quotes" ],
                        "content": [
                            {
                                "body": [
                                    {
                                        "body": [
                                            "I myself am best when least in company. - Duke Orsino (Twelfth Night - William Shakespeare)"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "Don’t walk in front of me… I may not follow. Don’t walk behind me… I may not lead. Walk beside me… just be my friend. - Albert Camus"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "We can know only that we know nothing. And that is the highest degree of human wisdom. - Pierre Bezukhov (War and Peace - Leo Tolstoy)"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "The only normal people are the ones you don't know very well. - Alfred Adler"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "Follow your heart but take your brain with you. - Alfred Adler"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "So, if you are too tired to speak, sit next to me for I, too, am fluent in silence. - R. Arnold"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "The life that ends at the age of twenty and the life that ends at ninety are both complete lives, and lives of happiness. - Philosopher (The courage to be disliked - Fumitake Koga and Ichiro Kishimi)"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "Between the lines of every story there is another story, and that is one that is never heard and can only be guessed at by the people who are good at guessing. - Frances Hodgson Burnett"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "Often we pass beside happiness without seeing it, without looking at it, or even if we have seen and looked at it, without recognizing it. - Sinbad the sailor (The Count of Monte Cristo - Alexandre Dumas)"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "If you gaze for long into an abyss, the abyss gazes also into you. - Friedrich Nietzsche"
                                        ]
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "title": [ "10 favorite songs" ],
                        "body": "I have a very specific taste in music. Though it is difficult to describe what my exact preference is, my playlists mostly include grunge, britpop, indie, classic-rock, and nu-metal songs. I am particularly a big fan of '90s alternative music.",
                        "content": [
                            {
                                "body": [
                                    {
                                        "body": [
                                            "Hunger Strike - Temple of the Dog"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "High and Dry - Radiohead"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "Patience - Chris Cornell (Cover)"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "Sithija Reka - Kasun Kalhara, Indrachapa Liyanage"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "Ordinary World - Duran Duran"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "Would - Alice in Chains"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "Green Eyes - Coldplay"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "Dumb - Nirvana"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "Driftwood - Travis"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "Sandawathiye - Ridma Weerawardena, Charitha Attalage"
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    }
}
