{
    "pageTitle": "About Me",
    "content": {
        "firstPara": [
            {
                "key": "me-1",
                "body": "Hello everyone! I am a research engineer at KTH Royal Institute of Technology working on enhancing software supply chain security as part of the CHAINS project. I am interested in research in the areas of software security, software testing and software reliability."
            }
        ],
        "contentDetails": [
            {
                "title": "Education",
                "content": [
                    {
                        "title": [
                            "Department of Computer Science and Engineering, Faculty of Engineering, University of Moratuwa",
                            "Bachelor of the Science of Engineering, Specialisation: Computer Science & Engineering",
                            "Aug 2017 - July 2022"
                        ],
                        "content": [
                            {
                                "body": []
                            }
                        ]
                    },
                    {
                        "title": [
                            "Primary and Secondary Education",
                            "Southlands College, Galle, Sri Lanka",
                            "2003-2016"
                        ],
                        "content": [
                            {
                                "body": []
                            }
                        ]
                    }
                ]
            },
            {
                "title": "Misc",
                "content": [
                    {
                        "title": [
                            "Table Tennis"
                        ],
                        "content": [
                            {
                                "body": [
                                    {
                                        "body": [
                                            "I love sports in general. Through the years, from time to time, I have been following Cricket, Tennis, and Football games. However, the only sport I actually played was Table Tennis. I started playing Table Tennis when I was 6 years old. There were many times that I fell out of love for the game, but my parents' enthusiasm to see me play kept me going. In case you are interested, here is a boring but still non-exhaustive list of my Table Tennis achievements."
                                        ]
                                    }
                                ]
                            },
                            {
                                "title": "Representing the Table Tennis team of WSO2 LLC",
                                "body": [
                                    {
                                        "body": [
                                            "2023 - Inter IT Club Knockout Tournament Women's Doubles - Champion"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2023 - Inter IT Club Knockout Tournament Mixed Doubles - Champion"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2022 - 63rd Mercantile Inter Club League Championship Women's C Division - Runner-up"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2022 - MTTA Individual Open Championship Novices Women's - Champion"
                                        ]
                                    }
                                ],
                                "images": [
                                    {
                                        "image": "/static/images/me/tt_wso2_1.jpeg",
                                        "alt": "yogya gamage - 1"
                                    },
                                    {
                                        "image": "/static/images/me/tt_wso2_2.jpg",
                                        "alt": "yogya gamage - 1"
                                    },
                                    {
                                        "image": "/static/images/me/tt_wso2_3.jpg",
                                        "alt": "yogya gamage - 1"
                                    }
                                ]
                            },
                            {
                                "title": "Representing the Table Tennis team of the University of Moratuwa",
                                "body": [
                                    {
                                        "body": [
                                            "2019 - Sri Lanka University Games - Champion"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2019 - University of Moratuwa Colors Award"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2019 - Wayo Spins Inter University tournament - Champion"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2019 - SIEG Inter University tournament - Champion"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2018 - Inter University Games - Champion"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2018 - University of Moratuwa Colors Award"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2018 - Mora Smashes Inter University tournament - Champion"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2018 - Wayo Spins Inter University tournament - Champion"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2018 - KDU Leaders' Trophy Inter University tournament - Champion"
                                        ]
                                    }
                                ],
                                "images": [
                                    {
                                        "image": "/static/images/me/tt_mora_1.jpg",
                                        "alt": "yogya gamage - 1"
                                    },
                                    {
                                        "image": "/static/images/me/tt_mora_2.jpg",
                                        "alt": "yogya gamage - 1"
                                    },
                                    {
                                        "image": "/static/images/me/tt_mora_3.jpg",
                                        "alt": "yogya gamage - 1"
                                    }
                                ]
                            },
                            {
                                "title": "Representing the Table Tennis team of Southland College",
                                "body": [
                                    {
                                        "body": [
                                            "2013 - All Island School Games - Silver Medal"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2013 - Southern Province Sports Colors"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2012 - All Island School Games - Silver Medal"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2012 - All Island Inter-School Under 19 Girls C-Division - Champion"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2012 - All Island Inter-School Under 18 Girls B-Division - Runner-Up"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2011-  All Island School Games - Bronze Medal"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2011 - All Island Inter-School Under 16 Girls B-Division - Runner-Up"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2010 - All Island Inter-School Under 14 Girls B-Division - Champion"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2010 - All Island Inter-School Under 18 Girls C-Division - Runner-Up"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2009 - All Island Inter-School Under 12 Girls A-Division - Runner-Up"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2009 - All Island Inter-School Under 16 Girls C-Division - Champion"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2008 - All Island Inter-School Under 12 Girls C-Division - Champion"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2007 - Sri Lanka Table Tennis Colors - Merit Award"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2007 - All Island Inter-School Under 10 Girls A-Division - Champion"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2005 - All Island Inter-School Under 10 Girls A-Division - Runner-Up"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2004 - All Island Inter-School Under 10 Girls B-Division - Runner-Up"
                                        ]
                                    }
                                ],
                                "images": [
                                    {
                                        "image": "/static/images/me/tt_scg_1.jpg",
                                        "alt": "yogya gamage - 1"
                                    },
                                    {
                                        "image": "/static/images/me/tt_scg_2.jpg",
                                        "alt": "yogya gamage - 1"
                                    },
                                    {
                                        "image": "/static/images/me/tt_scg_3.jpg",
                                        "alt": "yogya gamage - 1"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "title": [ "Other hobbies" ],
                        "content": [
                            {
                                "body": [
                                    {
                                        "body": [
                                            "Books, music, and movies have always been a big influence on me, shaping who I am in so many ways. My taste for books and movies swings wildly from cheerful, rainbow-filled stories to dark, unsettling stuff. But, though I have tried, I just can't get into sitcoms or action/adventure/sci-fi superhero movies. When it comes to music, I'm no expert, and yet I have a specific taste. I like melodies with unpredictable variations, lyrics with emotional honesty, and vocals with minimum autotune. It is always hard to list out favorites, but just to give a glimpse of my current tastes, here’s a list of some quotes that resonate with me—mostly taken from books."
                                        ]
                                    }
                                ]
                            },
                            {
                                "body": [
                                    {
                                        "body": [
                                            "Don’t walk in front of me… I may not follow. Don’t walk behind me… I may not lead. Walk beside me… just be my friend. - Albert Camus"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "If I justify myself, mine own mouth shall condemn me. - Job:9:20 (Found in the book The Silent Patient - Alex Michaelides)"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "So, if you are too tired to speak, sit next to me for I, too, am fluent in silence. - R. Arnold"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "We can know only that we know nothing. And that is the highest degree of human wisdom. - Pierre Bezukhov (War and Peace - Leo Tolstoy)"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "Often we pass beside happiness without seeing it, without looking at it, or even if we have seen and looked at it, without recognizing it. - Sinbad the sailor (The Count of Monte Cristo - Alexandre Dumas)"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "Between the lines of every story there is another story, and that is one that is never heard and can only be guessed at by the people who are good at guessing. - Frances Hodgson Burnett"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "Follow your heart but take your brain with you. - Alfred Adler"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "“I wish it need not have happened in my time,” said Frodo. “So do I,” said Gandalf, “and so do all who live to see such times. But that is not for them to decide. All we have to decide is what to do with the time that is given us.” (The Fellowship of the Ring - J. R. R. Tolkien)"
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    }
}
