{
    "pageTitle": "Who am I ?",
    "content": {
        "firstPara": [
            {
                "key": "me-1",
                "body": "Hello everyone! I am a highly motivated and hardworking individual with a strong passion for exploring the fascinating areas of Computer Science, particularly Front End Development and UI/UX Designing. I thrive on challenges and love to create intuitive and visually captivating user experiences."
            },
            {
                "key": "me-2",
                "body": "Beyond technology, I have a deep curiosity for psychology and its profound impact on human behaviour and decision-making. This diverse interest drives me to approach problem-solving from a unique and empathetic perspective, understanding users' and development teams' needs and aspirations."
            },
            {
                "key": "me-3",
                "body": "Throughout my journey, I strive to leave a lasting positive impact on my professional and personal pursuits. My life goal is to create something exceptional, that my father would one day be truly proud of."
            },
            {
                "key": "me-4",
                "body": "Let's connect and embark on an exciting journey of knowledge, growth, and creativity. Together, let's contribute to shaping a brighter and more empathetic world through technology."
            }
        ],
        "fistImages": [
            {
                "image": "/images/me/me-1.jpg",
                "alt": "achintha isuru - 1"
            },
            {
                "image": "/images/me/me-2.jpg",
                "alt": "achintha isuru - 1"
            },
            {
                "image": "/images/me/me-3.jpg",
                "alt": "achintha isuru - 1"
            }
        ],
        "contentDetails": [
            {
                "title": "Education",
                "content": [
                    {
                        "title": [
                            "Google (through Coursera)",
                            "Google UX Design Professional Certificate",
                            "May 2022 - Present"
                        ],
                        "content": [
                            {
                                "body": "I embarked on the Google UX Design Professional Certificate journey to gain firsthand experience and knowledge in UX designing. This comprehensive program has allowed me to immerse myself in the world of UX design, delving deeply into its nuances. Through the course, I've gained insights into the fundamental aspects of the design process, including user empathy, pain point definition, ideation of solutions, wireframing and prototyping, as well as testing and iterative design. I am currently following this course."
                            }
                        ]
                    },
                    {
                        "title": [
                            "Department of Computer Science and Engineering, Faculty of Engineering, University of Moratuwa",
                            "Bachelor of the Science of Engineering, Specialisation: Computer Science & Engineering",
                            "Aug 2017 - Dec 2022"
                        ],
                        "content": [
                            {
                                "body": [
                                    {
                                        "body": "My academic journey culminated at the University of Moratuwa's Department of Computer Science and Engineering, Sri Lanka. This esteemed institution honed my skills and knowledge, granting me a Bachelor of Science in Engineering with a specialization in Computer Science & Engineering. While excelling in my studies, I concurrently engaged in enriching extracurricular pursuits."
                                    },
                                    {
                                        "body": "During my time, I actively participated in extracurricular activities, enhancing my holistic learning experience. I represented my university as the goalkeeper for the soccer team, fostering teamwork and athletic prowess on the field. As a dedicated member of the Rotaract Club of the University of Moratuwa, I contributed to the public relations team, engaging in initiatives that nurtured community bonds and social responsibility."
                                    },
                                    {
                                        "body": "This balance between academic excellence and active involvement enriched my university years, fostering a well-rounded skill set and a sense of camaraderie with my peers."
                                    }
                                ],
                                "images": [
                                    {
                                        "image": "/images/me/uni-1.jpg",
                                        "alt": "achintha isuru - 1"
                                    },
                                    {
                                        "image": "/images/me/uni-2.jpg",
                                        "alt": "achintha isuru - 1"
                                    },
                                    {
                                        "image": "/images/me/uni-3.jpg",
                                        "alt": "achintha isuru - 1"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "title": [
                            "California Institute of the Art (through Coursera)",
                            "UI/UX Specialization",
                            "2020-2021"
                        ],
                        "content": [
                            {
                                "body": [
                                    {
                                        "body": "I pursued the UI/UX Specialization offered by the California Institute of the Arts through Coursera, a transformative journey that acquainted me with the essential foundations of UI/UX design. This course held particular significance, as it provided insights and knowledge not covered within the curriculum of my bachelor's degree. The specialization proved immensely beneficial, equipping me with practical expertise that extended beyond my academic studies."
                                    },
                                    {
                                        "body": "Moreover, the knowledge gained from this course facilitated the acquisition of UI/UX freelancing opportunities upon completion. These experiences proved instrumental in advancing my skill set, elevating both my proficiency and confidence in the field. This comprehensive specialization from a renowned institution greatly augmented my capabilities and prepared me for the dynamic realm of UI/UX design."
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "title": "Hosted Sessions",
                "content": [
                    {
                        "title": [
                            "Introduction to Basics of UI Designing (Sinhala)",
                            "Brain Wave Coaching session 2.0. Organized by the Society of Transport & Logistics University of Moratuwa, Sri Lanka",
                            "Oct 2021"
                        ],
                        "content": [
                            {
                                "body": "In October 2021, I had the privilege of hosting an engaging session titled 'Introduction to Basics of UI Designing' as part of the Brain Wave Coaching Session 2.0, organized by the Society of Transport & Logistics at the University of Moratuwa. This enlightening session provided participants with insights into the fundamentals of UI designing, delivered in the Sinhala language. By sharing key concepts and practical strategies, attendees gained valuable insights into the world of user interface design, enriching their skill sets and fostering their understanding of this critical domain. It was an honor to contribute to this exceptional educational initiative that catered to both the learning and professional growth of participants.",
                                "presentations": [
                                    {
                                        "link": "https://www.youtube.com/embed/bPJwYzVxxr4"
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "title": "My Hobbies",
                "content": [
                    {
                        "title": [
                            "Playing Football"
                        ],
                        "content": [
                            {
                                "body": [
                                    {
                                        "body": "I am deeply passionate about football, and my determination to play the sport led me to embrace the opportunity in university to gain firsthand experience on the field. It was all about pursuing my love for the game and enjoying every moment."
                                    },
                                    {
                                        "body": "During my university journey, I had the privilege of being part of a dedicated team that achieved remarkable success. Together, we secured the joint championship at the prestigious Sri Lanka University Games in 2019, a moment that remains a source of pride for me."
                                    },
                                    {
                                        "body": "Playing football honed my athletic abilities and proved to be a platform for personal growth. It was an environment where I developed essential soft skills, such as effective teamwork, unwavering commitment, and unyielding dedication. These qualities continue to serve as valuable assets in my professional endeavours, contributing to my success in the workplace."
                                    },
                                    {
                                        "body": "Football has been more than just a sport for me; it has been a journey of self-discovery, resilience, and camaraderie that has shaped my personal and professional life."
                                    }
                                ],
                                "images": [
                                    {
                                        "image": "/images/me/soccer-1.jpg",
                                        "alt": "achintha isuru - 1"
                                    },
                                    {
                                        "image": "/images/me/soccer-2.jpg",
                                        "alt": "achintha isuru - 1"
                                    },
                                    {
                                        "image": "/images/me/soccer-3.jpg",
                                        "alt": "achintha isuru - 1"
                                    },
                                    {
                                        "image": "/images/me/soccer-4.jpg",
                                        "alt": "achintha isuru - 1"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "title": [
                            "Social Service"
                        ],
                        "content": [
                            {
                                "body": [
                                    {
                                        "body": "As an individual deeply committed to voluntary work, I have always sought ways to give back to my community, inspired by my mother's battle with cancer during my childhood. Joining the Rotaract Club of the University of Moratuwa provided me with the perfect platform to fulfil this commitment."
                                    },
                                    {
                                        "body": "One of the most unforgettable experiences of my life was working on a project for the university's Rotaract Club. We spent a day at the Dharma Chakra Child Foundation, where I had the privilege of bringing smiles to the faces of children who face daily adversities. It was an immensely gratifying experience to offer them a day of joy and happiness."
                                    },
                                    {
                                        "body": "Beyond that, I actively contributed to the success of various other club projects, including 'I am Ready', 'Manusath Handa', and 'Ceylon Safari 2018', serving as a member of the organizing committee. Additionally, I co-chaired the project 'First Round Workshop of Maestro'18', further enhancing my leadership and teamwork skills."
                                    },
                                    {
                                        "body": "On a personal level, my involvement in Rotaract Club helped me nurture essential values like empathy and compassion, qualities that are invaluable for a designer. Through these experiences, I have grown both professionally and personally, reinforcing my belief in the power of volunteer work to create positive change."
                                    }
                                ],
                                "images": [
                                    {
                                        "image": "/images/me/rot-1.jpg",
                                        "alt": "achintha isuru - 1"
                                    },
                                    {
                                        "image": "/images/me/rot-2.jpg",
                                        "alt": "achintha isuru - 1"
                                    },
                                    {
                                        "image": "/images/me/rot-3.jpg",
                                        "alt": "achintha isuru - 1"
                                    }
                                ]
                                
                            }
                        ]
                    },
                    {
                        "title": [
                            "Cooking"
                        ],
                        "content": [
                            {
                                "body": "Cooking is a passion of mine, and I find immense joy in creating culinary delights. During my leisure hours, I indulge in experimenting with diverse recipes sourced from online platforms. I take great pleasure in the art of crafting dishes that amaze the taste buds ( Not sure if they do all the time though! 😉 ). My favourite dishes are my waffles and dhosi.",
                                "images": [
                                    {
                                        "image": "/images/me/cooking-1.jpeg",
                                        "alt": "cooking - 1"
                                    },
                                    {
                                        "image": "/images/me/cooking-2.jpeg",
                                        "alt": "cooking - 2"
                                    },
                                    {
                                        "image": "/images/me/cooking-3.jpeg",
                                        "alt": "cooking - 3"
                                    },
                                    {
                                        "image": "/images/me/cooking-4.jpeg",
                                        "alt": "cooking - 4"
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    }
}