{
    "publication": {
        "pageTitle": "Publications",
        "publications": [
            {
                "title": "Y. Gamage, D. Tiwari, M. Monperrus, B. Baudry 'The Design Space of Lockfiles Across Package Managers'",
                "link": "https://arxiv.org/pdf/2505.04834"
            },
            {
                "title": "Y. Gamage, N.G. Fernandez, M. Monperrus, B. Baudry 'Software Bills of Materials in Maven Central', 2025 Mining Software Repositories (MSR) Mining Challenge, 2025.",
                "link": "https://arxiv.org/pdf/2501.13832"
            },
            {
                "title": "D. Tiwari, Y. Gamage, M. Monperrus, B. Baudry 'PROZE: Generating Parameterized Unit Tests Informed by Runtime Data', 2024 IEEE International Conference on Source Code Analysis and Manipulation (SCAM), 2024, pp. 166-176, doi: 10.1109/SCAM63643.2024.00025.",
                "link": "https://www.computer.org/csdl/proceedings-article/scam/2024/285000a166/22NQUy3K1eo"
            },
            {
                "title": "B. Baudry, K. Etemadi, S. Fang, Y. Gamage, Y. Liu, Y. Liu, M. Monperrus, J. Ron, A. Silva, D. Tiwari 'Generative AI to Generate Test Data Generators', IEEE Software Special Issue on Generative AI for Software Engineering, doi: 10.1109/MS.2024.3418570.",
                "link": "https://ieeexplore.ieee.org/document/10577477"
            },
            {
                "title": "F. R. Garcia, Y. T. Gamage, G. Skoglund, B. Baudry, M. Monperrus 'A Benchmark of Reproducible Breaking Dependency Updates', 2024 31st IEEE International Conference on Software Analysis, Evolution and Reengineering (SANER)",
                "link": "https://www.computer.org/csdl/proceedings-article/saner/2024/306600a159/1YCRo7Xi5K8"
            },
            {
                "title": "Y. T. Gamage, T. A. I. Thotawaththa, and A. Wijayasiri, 'Measuring road roughness through crowdsourcing while minimizing the conditional effects,' International journal of intelligent transportation systems research, vol. 20, no. 2, p. 581–601, 2022. doi: 10.1007/s13177-022-00312-6.",
                "link": "https://link.springer.com/article/10.1007/s13177-022-00312-6"
            },
            {
                "title": "Y. T. Gamage, T. A. I. Thotawaththa and A. Wijayasiri, 'Identification of Road Surface Anomalies Using Crowdsourced Smartphone Sensor Data' 2022 22nd International Conference on Advances in ICT for Emerging Regions (ICTer), 2022, pp. 118-123, doi: 10.1109/ICTer58063.2022.10024097.",
                "link": "https://ieeexplore.ieee.org/document/10024097"
            },
            {
                "title": "T. A. I. Thotawaththa, Y. T. Gamage, D. Gamlath, W. Chee and D. Meedeniya, 'Automated Categorization of Privacy Policies Based on User Perspective' 2021 10th International Conference on Information and Automation for Sustainability (ICIAfS), 2021, pp. 54-59, doi: 10.1109/ICIAfS52090.2021.9606158.",
                "link": "https://link.springer.com/article/10.1007/s13177-022-00312-6"
            }
        ]
    }
}
