{
    "publication": {
        "pageTitle": "Publications",
        "publications": [
            {
                "title": "D. Tiwari, Y. Gamage, M. Monperrus, B. Baudry 'PROZE: Generating Parameterized Unit Tests Informed by Runtime Data'",
                "link": "https://arxiv.org/pdf/2407.00768"
            },
            {
                "title": "B. Baudry, K. Etemadi, S. Fang, Y. Gamage, Y. Liu, Y. Liu, M. Monperrus, J. Ron, A. Silva, D. Tiwari 'Generative AI to Generate Test Data Generators', IEEE Software Special Issue on Generative AI for Software Engineering, doi: 10.1109/MS.2024.3418570.",
                "link": "https://ieeexplore.ieee.org/document/10577477"
            },
            {
                "title": "F. R. Garcia, Y. T. Gamage, G. Skoglund, B. Baudry, M. Monperrus 'A Benchmark of Reproducible Breaking Dependency Updates', 2024 31st IEEE International Conference on Software Analysis, Evolution and Reengineering (SANER)",
                "link": "https://arxiv.org/pdf/2401.09906"
            },
            {
                "title": "Y. T. Gamage, T. A. I. Thotawaththa, and A. Wijayasiri, 'Measuring road roughness through crowdsourcing while minimizing the conditional effects,' International journal of intelligent transportation systems research, vol. 20, no. 2, p. 581–601, 2022. doi: 10.1007/s13177-022-00312-6.",
                "link": "https://link.springer.com/article/10.1007/s13177-022-00312-6"
            },
            {
                "title": "Y. T. Gamage, T. A. I. Thotawaththa and A. Wijayasiri, 'Identification of Road Surface Anomalies Using Crowdsourced Smartphone Sensor Data' 2022 22nd International Conference on Advances in ICT for Emerging Regions (ICTer), 2022, pp. 118-123, doi: 10.1109/ICTer58063.2022.10024097.",
                "link": "https://ieeexplore.ieee.org/document/10024097"
            },
            {
                "title": "T. A. I. Thotawaththa, Y. T. Gamage, D. Gamlath, W. Chee and D. Meedeniya, 'Automated Categorization of Privacy Policies Based on User Perspective' 2021 10th International Conference on Information and Automation for Sustainability (ICIAfS), 2021, pp. 54-59, doi: 10.1109/ICIAfS52090.2021.9606158.",
                "link": "https://link.springer.com/article/10.1007/s13177-022-00312-6"
            }
        ]
    },
    "talks": {
        "pageTitle": "Talks",
        "talks": [
            {
                "title": "Demo of 'Maven Lockfile' at the 3rd KTH Workshop on the Software Supply Chain.",
                "presentations": [
                    {
                        "link": "https://www.youtube.com/embed/5HwNIYAiRQg?si=Uja7c3gs_tSHEvGh"
                    }
                ]
            },
            {
                "title": "Presentation of the paper 'Identification of Road Surface Anomalies Using Crowdsourced Smartphone Sensor Data' at ICTer, 2022.",
                "presentations": [
                    {
                        "link": "https://www.youtube.com/embed/O7FjlFIGfUM?si=ML7_dXpsOv8ImIZe"
                    }
                ]
            },
            {
                "title": "Presentation of the paper 'Automated Categorization of Privacy Policies Based on User Perspective' at ICIAFS, 2021.",
                "presentations": [
                    {
                        "link": "https://www.youtube.com/embed/Kdg_HHW5kvE?si=NKAqICh-k5u2kw27"
                    }
                ]
            }
        ]
    },
    "research": {
        "pageTitle": "Research Projects",
        "projects": [
            {
                "name": "Creating a Benchmark of Breaking Dependency Updates",
                "duration": "2023 May - 2023 Oct",
                "place": "KTH Royal Institute of Technology, Sweden",
                "content": [
                    {
                        "body": "In this research, we created a new benchmark called BUMP that contains reproducible breaking dependency updates in Java projects built with the Maven build system. BUMP ensures long-term reproducibility of dependency updates on different platforms, guaranteeing consistent build failures to support future research. We also researched on the different causes of build breakage, discovering novel insights on breaking updates."
                    }
                ]
            },
            {
                "name": "Monitoring Road Quality Using Crowdsourced Smartphone Sensor Data",
                "duration": "2021 April - 2022 April",
                "place": "University of Moratuwa, Sri Lanka",
                "content": [
                    {
                        "body": "This study is an attempt to develop a road roughness monitoring platform using passenger cars that can produce accurate results while reducing the effect of these conditions such as the car type, smartphone model, or its placement. The developed system consists of several features including automatic journey detection, freedom to use any smartphone in any position with or without an active internet connection when collecting data, converging values collected from different sources, and visualizing them in a virtual map. This project was carried out in collaboration with the Road Development Authority, Sri Lanka, under the supervision of Dr. Adeesha Wijayasiri."
                    }
                ]
            },
            {
                "name": "Automated Categorization of Privacy Policies Based on User Perspective",
                "duration": "2020 May - 2021 May",
                "place": "University of Moratuwa, Sri Lanka",
                "content": [
                    {
                        "body": "This study aims to propose an approach to convey privacy policies in a way that a common user can comprehend. We identified 10 categories to classify headers and sections of privacy policies, selected after considering both the users' and domain experts' views. We also experimented on creating automated privacy policy classification models using BERT, SVM, Naive Bayes, and BiLSTM. This project was done in collaboration with Sieve Singapore under the supervision of Prof. Dulani Meedeniya."
                    }
                ]
            }
        ]
    }
}
